models/FahrzeugVehicle.php

    public function beforeSave($insert)
    {
        //var_dump($insert);Exit();

        if($this->isNewRecord && !(FzgBestand::findOne($this->nr_inside_id))) {
            $fzg_b = new FzgBestand();
            $fzg_b->id = $this->nr_inside_id;
            $fzg_b->modell = $this->modell_car_model;
            $fzg_b->fin = $this->fin_vehicle_number;
            $fzg_b->nr = $this->alte_nr_old_insite_number;
            $fzg_b->vk_status = $this->verkaufsstatus_sale_state;
            /*$fzg_b->ek_datum = null;
            $fzg_b->verkaeufer = null;
            $fzg_b->ek_netto_preis = null;
            $fzg_b->ek_mwst = null;
            $fzg_b->ek_brutto_preis = null;
            $fzg_b->vk_datum = null;
            $fzg_b->kaeufer = null;
            $fzg_b->vk_netto_preis = null;
            $fzg_b->vk_mwst = null;
            $fzg_b->vk_brutto_preis = null;
            $fzg_b->gewinn = null;
            $fzg_b->mitarbeiter_employee = null;
            $fzg_b->sonstiges = null;*/
            $fzg_b->save();
            // var_dump($fzg_b->getErrors());Exit();
        }
        else if(($fzg_b = FzgBestand::findOne($this->nr_inside_id)) != null){
---
SELECT * FROM `fzg_bestand` WHERE `id`='1'