models/VerkaufSale.php

SELECT * FROM `fzg_bestand` WHERE `id`='1'
---
    public function beforeSave($insert)
    {
        //var_dump($insert);Exit();
        if($this->isNewRecord && !(FzgBestand::findOne($this->verkaufsnummer_sale_id))) {
            $fzg_b = new FzgBestand();
            $fzg_b->id = $this->verkaufsnummer_sale_id;
            $fzg_b->fin = $this->fin_vehicle_id;
            $fzg_b->vk_datum = $this->verkaufsdatum_sale_date;
            $fzg_b->kaeufer = $this->kaeufersname_customersname;
            $fzg_b->vk_netto_preis = $this->nettopreis_net_price;
            $fzg_b->vk_mwst = $this->mws_value_added_tax;
            $fzg_b->vk_brutto_preis = $this->bruttopreis_gross_price;
            $fzg_b->gewinn = $this->gewinn_profit;
            $fzg_b->mitarbeiter_employee = $this->mitarbeiter_employee;
            $fzg_b->vk_status=1;
          /*
            $fzg_b->modell = $this->modell_car_model;
            $fzg_b->fin = $this->fin_vehicle_number;
            $fzg_b->nr = $this->alte_nr_old_insite_number;
            $fzg_b->ek_datum = null;
            $fzg_b->verkaeufer = null;
            $fzg_b->ek_netto_preis = null;
            $fzg_b->ek_mwst = null;
            $fzg_b->ek_brutto_preis = null;
            $fzg_b->sonstiges = null;*/
            $fzg_b->save();
            // var_dump($fzg_b->getErrors());Exit();
        }
        else if(($fzg_b = FzgBestand::findOne($this->verkaufsnummer_sale_id)) != null){